Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K47B.tmx
Source language: en_us
Languages: zh_cn

source: UNEXPECTANCIES
zh_cn: 意料之外

source: Diane, I remember after that really bad break-up of mine - the kind that doesn't seem so long ago but is? - you were the one who pulled me out of my hall closet where I tried to hide from the pain, me there alone with the broom and the dustpan.
zh_cn: 黛安，我彻底分手这件事似乎没过多长时间，但又的确是这样？在那之后，你就是那个把我从大厅的柜子里拉出来的人。在那里，我努力在痛苦中躲藏，与扫帚和畚箕为伴。

source: Later, when I moved to the much-smaller studio apartment where I live now, you were the one who unpacked my clothes.
zh_cn: 后来，当我搬到了面积更小公寓，也就是现在正住的地方，你就是那个帮我把衣物整理好的人。

source: Here, years later, the places where you first put the folded sweaters and jeans remain the same.
zh_cn: 好些年后，你叠毛线衫和牛仔裤的地方还是老样子。

source: And the day my doctor told me there would be no children for me, you were the one who met me at Starbucks and sat quietly as I cried into my latte.
zh_cn: 那天，我的医生告诉我，我可能不会有孩子了。你就是那个和我在星巴克见面、当我眼泪滴进咖啡里静静坐着的人。

source: But, Diane, I remember the good times too.
zh_cn: 但是，黛安，我也同样记得我们之间的美好时光。

source: You taught me how, as an adult, to ride a bike - as a child, I'd never really learned.
zh_cn: 你教我这个成年人如何骑自行车——孩童时，我从来没有真正地学过。

source: And I never really had a best friend then, just a shadowy girl I'd met in kindergarten who followed me around through grade school, avoiding, as I did, games the other kids played during recess.
zh_cn: 我那时从来没有过一个知己，只有一个我在幼儿园见过的内向女孩，之后我和她一起上了中学。跟我一样，她在课间从不和其他孩子玩耍。

source: Diane, you told me most earnestly that you had no intention of ever having a child; that you loved your life the way it was.
zh_cn: 黛安，你曾经很认真地告诉过我你没有要孩子的打算；你喜欢你现在的生活方式。

source: You made it OK for me to love my life just the way it was, too.
zh_cn: 你也同意我喜欢我现在这样的生活。

source: And then, not long after that, you told me you were "accidentally pregnant".
zh_cn: 现在，没过多久，你告诉我你“意外怀孕”了。

source: I don't remember if I said the right things, or made promises to always be there for you; if I let you keep drinking your wine or if I stopped you by putting my hand on yours, saying, "The baby...".
zh_cn: 我不记得我是否说了正确的事，抑或做了永远支持你的允诺；是否让你喝酒，又或是通过握着你的手阻止你喝，并说：“注意肚子里的孩子......”

source: When I go to my own doctor not long after, the news for me is also unexpected.
zh_cn: 在那之后，我又去见了医生，给我的消息是如此的出人意料。

source: As she moves the scope around, a frown creases her forehead. She declares, "Bonnie, you have a fibroid," and a few minutes later she presses a grainy black-and-white picture into my hand.
zh_cn: 当她皱着眉移动B超扫描作检查时，告诉我说：“邦尼，你长了一个纤维瘤，”几分钟后塞了一张有许多黑白颗粒的图片在我手里。

source: I take it home and stuff it into the far back of the junk drawer in my kitchen.
zh_cn: 我把它带回家后塞在厨房废物柜后面。

source: I stop by your house the next day and notice you have your sonogram baby-image on your fridge.
zh_cn: 第二天，我顺便走访你家，注意到你冰箱上贴的婴儿声纳扫描照片。

source: I can't bring myself to tell you my fibroid news. You explain how you and the father will be moving in together.
zh_cn: 我不能把自己长纤维瘤的消息告诉妳，你还一直说你将和你父亲搬在一起住的事情。

source: You shrug and say it's really for the best since the baby will be here so soon.
zh_cn: 你耸耸肩说，既然孩子不久就要生下来，住在一起是最好不过了。

source: You rattle off a slew of plans.
zh_cn: 你一口气说了一大串计划。

source: The look on your face is something I do not understand: contentment.
zh_cn: 你脸上的表情是我无法理解的某种东西：满足。

source: It builds a wall between us, brick by brick.
zh_cn: 然而，它在我们之间一点点地垒起了一道墙。

source: Back at home that evening, I pull out my own crumpled scan. Smoothing it down, I look at it critically.
zh_cn: 那天晚上回到家，我拿出那张皱巴巴的扫描图片，把它展开压平，重新审视地看了一下。

source: The fibroid is roughly the size of a quarter.
zh_cn: 纤维瘤大约有一枚硬币的大小。

source: I hold it up against my fridge and firmly press a magnet to it.
zh_cn: 我把它贴在冰箱上，又放了一块磁铁在上面。

source: There. We both have alien beings growing in our bodies.
zh_cn: 这样的话，我们俩体内都有外来物种成长。

source: Yours moves you forward to a burgeoning new life, but I don't know how to share the news with you or anyone about my fibroid.
zh_cn: 你的孩子引领你走向生机勃勃的新生活，但是我不知道如何和你或是其他人分享我有纤维瘤的消息。

source: We do bike together that weekend, Diane, remember?
zh_cn: 那个周末我们一起骑自行车，黛安，还记得吗？

source: One of our most-favorite activities.
zh_cn: 它是我们最喜爱的运动之一。

source: But on this day I realize it will be our last ride for a long, long time.
zh_cn: 但那天我意识到，这恐怕是我们最后一次长时间的骑行了。

source: When we do talk that afternoon, everything seems to be about plans for the baby.
zh_cn: 下午，我们谈论的一切似乎都是关于你孩子的计划。

source: I feel guilty even thinking about anything else while in your presence.
zh_cn: 在你面前一想到其它的事就会使我感到内疚。

source: I wish for the ride to be over before it even starts.
zh_cn: 我甚至希望这场骑行在它还没开始的时候就结束。

source: And, needless to say, I still don't tell you about the fibroid.
zh_cn: 而且，不需要说的是，我仍然不会告诉你我身上的纤维瘤。
